## SQL 入門

> 簡介

郭耀仁

In [1]:
import sqlite3
import pandas as pd
from test_queries.test_queries_03 import extract_test_queries as etq

conn_twelection = sqlite3.connect('twelection.db')
conn_nba = sqlite3.connect('nba.db')

## 在這門課程中，我們將入門 SQL

- [快速啟動](https://yaojenkuo.io/introduction-to-sql/01-getting-started.slides.html)
- [基本查詢](https://yaojenkuo.io/introduction-to-sql/02-retrieving-data.slides.html)
- [資料分析](https://yaojenkuo.io/introduction-to-sql/03-analyzing-data.slides.html)
- [操作資料](https://yaojenkuo.io/introduction-to-sql/04-operating-data.slides.html)

## 課程進行的方式

- 首先是授課
- 接著是範例
- 最後是隨堂練習

## 我們將從最基礎的 `SELECT` 與 `FROM` 開始

In [2]:
sql_query = """
SELECT * 
  FROM players;
"""

In [3]:
pd.read_sql(sql_query, conn_nba)

,firstName,lastName,temporaryDisplayName,personId,teamId,jersey,isActive,pos,heightFeet,heightInches,heightMeters,weightPounds,weightKilograms,dateOfBirthUTC,nbaDebutYear,yearsPro,collegeName,lastAffiliation,country,isallStar
0,Vince,Carter,"Carter, Vince",1713,1610612737,15.0,True,G-F,6,6,1.98,220,99.8,1977-01-26,1998,21,North Carolina,North Carolina/USA,USA,None
1,Tyson,Chandler,"Chandler, Tyson",2199,1610612745,19.0,True,C,7,0,2.13,235,106.6,1982-10-02,2001,18,No College,Dominguez HS (CA)/USA,USA,None
2,LeBron,James,"James, LeBron",2544,1610612747,23.0,True,F,6,9,2.06,250,113.4,1984-12-30,2003,16,None,St. Vincent-St. Mary HS (OH)/USA,USA,None
3,Carmelo,Anthony,"Anthony, Carmelo",2546,1610612757,0.0,True,F,6,8,2.03,238,108.0,1984-05-29,2003,16,Syracuse,Syracuse/USA,USA,None
4,Kyle,Korver,"Korver, Kyle",2594,1610612749,26.0,True,G-F,6,7,2.01,212,96.2,1981-03-17,2003,16,Creighton,Creighton/USA,USA,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
499,Matt,Thomas,"Thomas, Matt",1629744,1610612761,21.0,True,G,6,4,1.93,190,86.2,1994-08-04,2019,0,Iowa State,Iowa State/USA,USA,None
500,Tariq,Owens,"Owens, Tariq",1629745,1610612756,41.0,True,F,6,10,2.08,205,93.0,1995-06-30,2019,0,Texas Tech,Texas Tech/USA,USA,None
501,Javonte,Green,"Green, Javonte",1629750,1610612738,43.0,True,G-F,6,4,1.93,205,93.0,1993-07-23,2019,0,Radford University,Radford/USA,USA,None
502,Juwan,Morgan,"Morgan, Juwan",1629752,1610612762,16.0,True,F,6,7,2.01,232,105.2,1997-04-17,2019,0,Indiana,Indiana/USA,USA,None
503,Matt,Mooney,"Mooney, Matt",1629760,1610612739,31.0,True,G,6,2,1.88,199,90.3,1997-02-07,2019,0,Texas Tech,Texas Tech/USA,USA,None

## 到能夠回答複雜的資料分析問題

> 計算 presidential2020 韓國瑜/張善政與蔡英文/賴清德這兩組候選人在臺北市 12 個行政區中各自的得票數。

In [4]:
expected_output = pd.read_sql(etq('0318'), conn_twelection)

In [5]:
expected_output

   town  Kuo_Cheng  Ing_Te
0   中山區      56491   79022
1   中正區      41461   48183
2   信義區      62353   70285
3   內湖區      74437   94269
4   北投區      59851   90060
5   南港區      30968   40969
6   士林區      65183  104881
7   大同區      24673   50006
8   大安區      85490   88977
9   文山區      82305   78129
10  松山區      55918   64207
11  萬華區      46700   66866

## About me

A data enthusiast and instructor focused on practical Python/R/SQL

## Teaching practical data science online/offline

- [如何成為資料分析師：從問題解決到行動方案，Hahow 好學校](https://hahow.in/cr/dajourney)
- Visualization and modern data science, Adjunct Instructor, National Taiwan University
- Python for data analysis, Instructor, Chunghwa Telecom Academy
- Python for data science, Machine learning from scratch, Senior Instructor, CSIE Train, National Taiwan University

## Data science instructor focused on commercial banking clients

- 2020 DBS Python Training Program
- 2019 HNCB Python Training Program
- 2017 ESUN Python Training Program

## Writing books on data science

- [輕鬆學習 R 語言](https://www.datainpoint.com/r-essentials/)
- [進擊的資料科學](https://www.datainpoint.com/data-science-in-action/)
- [新手村逃脫！初心者的 Python 機器學習攻略](https://yaojenkuo.io/ml-newbies/index.html)

## Writing tutorials on [Medium](https://medium.com/) with 3k+ followers

- Follow my Medium account [@tonykuoyj](https://medium.com/@tonykuoyj)
- Or, follow my publication [DataInPoint](https://medium.com/datainpoint)
- Or, follow [DataInPoint](https://www.facebook.com/datainpoint) on Facebook

## Working experience

- Senior Data Analyst, Coupang Shanghai
- Analytical Consultant, SAS Taiwan
- Management Associate, Chinatrust Banking Corporation Taiwan
- Research Assistant, McKinsey & Company Taiwan

## Education

- MBA, National Taiwan University
- BA, National Taiwan University

## Loves running with a marathon PR of 2:43:12 at 2019 Seoul Marathon

## Future initiatives

Make [DataInPoint](https://www.datainpoint.com/) a text-based, in-browser, and subscription-only data science bootcamp.